/* No comment provided by engineer. */
"Account is disabled." = "Account is disabled.";

/* No comment provided by engineer. */
"Account is expired." = "Account is expired.";

/* No comment provided by engineer. */
"Account is inactive." = "Account is inactive.";

/* No comment provided by engineer. */
"Allocation failed" = "Allocation failed";

/* No comment provided by engineer. */
"An attribute value or values were not supported." = "An attribute value or values were not supported.";

/* No comment provided by engineer. */
"Attempt to create a query failed." = "Attempt to create a query failed.";

/* No comment provided by engineer. */
"Attribute does not exist." = "Attribute does not exist.";

/* No comment provided by engineer. */
"Attribute type is missing." = "Attribute type is missing.";

/* No comment provided by engineer. */
"Attribute value was not found." = "Attribute value was not found.";

/* No comment provided by engineer. */
"Attribute was not found." = "Attribute was not found.";

/* No comment provided by engineer. */
"Authentication failed." = "Authentication failed.";

/* No comment provided by engineer. */
"Authentication item(s) are missing." = "Authentication item(s) are missing.";

/* No comment provided by engineer. */
"Authentication type is missing." = "Authentication type is missing.";

/* No comment provided by engineer. */
"Authentication type was an empty value." = "Authentication type was an empty value.";

/* No comment provided by engineer. */
"Bogus server." = "Bogus server.";

/* No comment provided by engineer. */
"Cannot determine location of node to verify type." = "Cannot determine location of node to verify type.";

/* No comment provided by engineer. */
"Contact the master." = "Contact the master.";

/* where %@ is a node name like /LDAPv3/127.0.0.1 */
"Custom call %d failed to %@." = "Custom call %1$d failed to %2$@.";

/* No comment provided by engineer. */
"Custom call %d failed to node." = "Custom call %d failed to node.";

/* No comment provided by engineer. */
"Failure to get server replay cache information." = "Failure to get server replay cache information.";

/* No comment provided by engineer. */
"Failure to set connection addresses." = "Failure to set connection addresses.";

/* No comment provided by engineer. */
"inGroupRef was null." = "inGroupRef was null.";

/* No comment provided by engineer. */
"Invalid attribute mapping." = "Invalid attribute mapping.";

/* No comment provided by engineer. */
"Invalid attribute type." = "Invalid attribute type.";

/* No comment provided by engineer. */
"Invalid computer." = "Invalid computer.";

/* No comment provided by engineer. */
"Invalid domain." = "Invalid domain.";

/* No comment provided by engineer. */
"Invalid file path." = "Invalid file path.";

/* No comment provided by engineer. */
"Invalid logon hours." = "Invalid logon hours.";

/* No comment provided by engineer. */
"Invalid member record reference." = "Invalid member record reference.";

/* No comment provided by engineer. */
"Invalid record name supplied." = "Invalid record name supplied.";

/* No comment provided by engineer. */
"Invalid record reference." = "Invalid record reference.";

/* No comment provided by engineer. */
"Invalid record type." = "Invalid record type.";

/* No comment provided by engineer. */
"Invalid service principal from server." = "Invalid service principal from server.";

/* No comment provided by engineer. */
"Invalid type of attribute value." = "Invalid type of attribute value.";

/* No comment provided by engineer. */
"List of authentication items is missing." = "List of authentication items is missing.";

/* No comment provided by engineer. */
"Master is unreachable." = "Master is unreachable.";

/* No comment provided by engineer. */
"Maximum sessions reached." = "Maximum sessions reached.";

/* No comment provided by engineer. */
"Memory allocation error." = "Memory allocation error.";

/* No comment provided by engineer. */
"Memory allocation failure." = "Memory allocation failure.";

/* No comment provided by engineer. */
"Missing attribute name." = "Missing attribute name.";

/* No comment provided by engineer. */
"New password is missing." = "New password is missing.";

/* No comment provided by engineer. */
"New password required." = "New password required.";

/* No comment provided by engineer. */
"New values are missing." = "New values are missing.";

/* No comment provided by engineer. */
"No Kerberos cache available." = "No Kerberos cache available.";

/* No comment provided by engineer. */
"No principal assigned to cache." = "No principal assigned to cache.";

/* No comment provided by engineer. */
"No value provided." = "No value provided.";

/* No comment provided by engineer. */
"Node name is missing." = "Node name is missing.";

/* No comment provided by engineer. */
"Node name is null." = "Node name is null.";

/* No comment provided by engineer. */
"Node name not found." = "Node name not found.";

/* No comment provided by engineer. */
"Node not found." = "Node not found.";

/* No comment provided by engineer. */
"Node reference is missing." = "Node reference is missing.";

/* No comment provided by engineer. */
"Not allowed by schema." = "Not allowed by schema.";

/* No comment provided by engineer. */
"Not authorized." = "Not authorized.";

/* No comment provided by engineer. */
"Null parameter" = "Null parameter";

/* No comment provided by engineer. */
"ODNode was null" = "ODNode was null";

/* No comment provided by engineer. */
"Operation failed." = "Operation failed.";

/* No comment provided by engineer. */
"Operation not yet implemented." = "Operation not yet implemented.";

/* No comment provided by engineer. */
"Password cannot be changed yet." = "Password cannot be changed yet.";

/* No comment provided by engineer. */
"Password does not match complexity requirements." = "Password does not match complexity requirements.";

/* No comment provided by engineer. */
"Password is expired." = "Password is expired.";

/* No comment provided by engineer. */
"Password is missing." = "Password is missing.";

/* No comment provided by engineer. */
"Password is too long." = "Password is too long.";

/* No comment provided by engineer. */
"Password is too short." = "Password is too short.";

/* No comment provided by engineer. */
"Password needs a digit." = "Password needs a digit.";

/* No comment provided by engineer. */
"Password needs a letter." = "Password needs a letter.";

/* No comment provided by engineer. */
"Permission error." = "Permission error.";

/* No comment provided by engineer. */
"Proxy Address was missing." = "Proxy Address was missing.";

/* No comment provided by engineer. */
"Proxy password was missing." = "Proxy password was missing.";

/* No comment provided by engineer. */
"Proxy username was missing." = "Proxy username was missing.";

/* No comment provided by engineer. */
"Query reference is missing." = "Query reference is missing.";

/* No comment provided by engineer. */
"Read only." = "Read only.";

/* No comment provided by engineer. */
"Record already exists." = "Record already exists.";

/* No comment provided by engineer. */
"Record name is missing." = "Record name is missing.";

/* No comment provided by engineer. */
"Record name is missing.  At least one name must be provided." = "Record name is missing.  At least one name must be provided.";

/* No comment provided by engineer. */
"Record not found." = "Record not found.";

/* No comment provided by engineer. */
"Record type is disabled." = "Record type is disabled.";

/* No comment provided by engineer. */
"Record type is missing." = "Record type is missing.";

/* No comment provided by engineer. */
"Server timed out." = "Server timed out.";

/* No comment provided by engineer. */
"Service unavailable." = "Service unavailable.";

/* No comment provided by engineer. */
"Unable to access session." = "Unable to access session.";

/* where %1@ is an attribute value like 555-1212, %2@ is an attribute like RecordName/PhoneNumber */
"Unable to add %@ to %@ for a record." = "Unable to add %1$@ to %2$@ for a record.";

/* where %1@ is an attribute value like 555-1212, %2@ is an attribute like RecordName/PhoneNumber, %3@ is a record name like user1 */
"Unable to add %@ to %@ in record %@." = "Unable to add %1$@ to %2$@ in record %3$@.";

/* where both %@ are record names like user1, group1 */
"Unable to add %@ to group %@." = "Unable to add %1$@ to group %2$@.";

/* where %@ is a record name like user1 */
"Unable to add %@ to group." = "Unable to add %@ to group.";

/* No comment provided by engineer. */
"Unable to add a member to group." = "Unable to add a member to group.";

/* %@ is an attribute like RecordName/PhoneNumber */
"Unable to add a value to %@ for a record." = "Unable to add a value to %@ for a record.";

/* where %1@ is an attribute like RecordName/PhoneNumber, %2@ is a record name like user1 */
"Unable to add a value to %@ in record %@." = "Unable to add a value to %1$@ in record %2$@.";

/* where %@ is a record name like user1 */
"Unable to add an attribute value in record %@." = "Unable to add an attribute value in record %@.";

/* No comment provided by engineer. */
"Unable to add an attribute value to the record." = "Unable to add an attribute value to the record.";

/* where %@ is a group name like myGroup */
"Unable to add member to group %@." = "Unable to add member to group %@.";

/* where %1@ is an attribute value like 555-1212, %2@ is a record name like user1 */
"Unable to add the attribute value %@ in record %@." = "Unable to add the attribute value %1$@ in record %2$@.";

/* No comment provided by engineer. */
"Unable to allocate array for results." = "Unable to allocate array for results.";

/* No comment provided by engineer. */
"Unable to allocate buffer for response." = "Unable to allocate buffer for response.";

/* No comment provided by engineer. */
"Unable to allocate ODQuery" = "Unable to allocate ODQuery";

/* No comment provided by engineer. */
"Unable to change password for a record." = "Unable to change password for a record.";

/* where %@ is a record name like user1 */
"Unable to change password for record %@." = "Unable to change password for record %@.";

/* where %@ is a node name like /LDAPv3/127.0.0.1 */
"Unable to create a record in %@." = "Unable to create a record in %@.";

/* No comment provided by engineer. */
"Unable to create a record in node." = "Unable to create a record in node.";

/* where %1@ is a record name like user1 and %2@ is a node name like /LDAPv3/127.0.0.1 */
"Unable to create record %@ in %@." = "Unable to create record %1$@ in %2$@.";

/* where %@ is a record name like user1 */
"Unable to create record %@ in node." = "Unable to create record %@ in node.";

/* No comment provided by engineer. */
"Unable to delete a record." = "Unable to delete a record.";

/* where %@ is a record name like user1 */
"Unable to delete record %@." = "Unable to delete record %@.";

/* where both %@ are record names like user1, group2, etc. */
"Unable to determine if %@ is member of group %@." = "Unable to determine if %1$@ is member of group %2$@.";

/* where %@ is a record name like user1 */
"Unable to determine if %@ is member of group." = "Unable to determine if %@ is member of group.";

/* where %@ is a record name like myGroup */
"Unable to determine if member of group %@." = "Unable to determine if member of group %@.";

/* No comment provided by engineer. */
"Unable to determine if member of group." = "Unable to determine if member of group.";

/* No comment provided by engineer. */
"Unable to determine service ticket needed." = "Unable to determine service ticket needed.";

/* No comment provided by engineer. */
"Unable to determine subnodes." = "Unable to determine subnodes.";

/* No comment provided by engineer. */
"Unable to determine supported attributes." = "Unable to determine supported attributes.";

/* No comment provided by engineer. */
"Unable to determine supported record types." = "Unable to determine supported record types.";

/* No comment provided by engineer. */
"Unable to determine unreachable subnodes." = "Unable to determine unreachable subnodes.";

/* No comment provided by engineer. */
"Unable to determine user's principal name." = "Unable to determine user's principal name.";

/* No comment provided by engineer. */
"Unable to find node type %d." = "Unable to find node type %d.";

/* No comment provided by engineer. */
"Unable to get attributes from buffer returned by Directory Service." = "Unable to get attributes from buffer returned by Directory Service.";

/* No comment provided by engineer. */
"Unable to get details of record." = "Unable to get details of record.";

/* No comment provided by engineer. */
"Unable to get Kerberos tickets." = "Unable to get Kerberos tickets.";

/* where %@ is a node name like /LDAPv3/127.0.0.1 */
"Unable to get node details for %@." = "Unable to get node details for %@.";

/* No comment provided by engineer. */
"Unable to get node details." = "Unable to get node details.";

/* where %@ is a record name like user1 */
"Unable to get values attribute for record %@." = "Unable to get values attribute for record %@.";

/* where %1@ is some attribute like PhoneNumber or RecordName and %2@ is a record name like user1 */
"Unable to get values for attribute %@ of record %@." = "Unable to get values for attribute %1$@ of record %2$@.";

/* No comment provided by engineer. */
"Unable to get values for attribute of a record." = "Unable to get values for attribute of a record.";

/* No comment provided by engineer. */
"Unable to increase buffer for results." = "Unable to increase buffer for results.";

/* No comment provided by engineer. */
"Unable to initialize authentication context." = "Unable to initialize authentication context.";

/* No comment provided by engineer. */
"Unable to initialize Kerberos." = "Unable to initialize Kerberos.";

/* No comment provided by engineer. */
"Unable to make copy of node." = "Unable to make copy of node.";

/* No comment provided by engineer. */
"Unable to map standard attribute to native attribute." = "Unable to map standard attribute to native attribute.";

/* where %@ is the name of a node like /LDAPv3/127.0.0.1 */
"Unable to open Directory node with name %@." = "Unable to open Directory node with name %@.";

/* No comment provided by engineer. */
"Unable to open Directory node with type %d." = "Unable to open Directory node with type %d.";

/* No comment provided by engineer. */
"Unable to open Directory node." = "Unable to open Directory node.";

/* No comment provided by engineer. */
"Unable to open node." = "Unable to open node.";

/* No comment provided by engineer. */
"Unable to open retrieve available node names for session." = "Unable to open retrieve available node names for session.";

/* No comment provided by engineer. */
"Unable to open session." = "Unable to open session.";

/* No comment provided by engineer. */
"Unable to parse buffer returned by Directory Service." = "Unable to parse buffer returned by Directory Service.";

/* No comment provided by engineer. */
"Unable to parse service principal." = "Unable to parse service principal.";

/* No comment provided by engineer. */
"Unable to parse the information from server." = "Unable to parse the information from server.";

/* No comment provided by engineer. */
"Unable to parse the name of the service." = "Unable to parse the name of the service.";

/* where %1@ is an attribute value like 555-1212, %2@ is an attribute like RecordName/PhoneNumber, %3@ is a record name like user1 */
"Unable to remove %@ from %@ for record %@." = "Unable to remove %1$@ from %2$@ for record %3$@.";

/* where %1@ is an attribute value like 555-1212, %2@ is an attribute like RecordName/PhoneNumber */
"Unable to remove %@ from %@ for the record." = "Unable to remove %1$@ from %2$@ for the record.";

/* where both %@ are record names like user1, group1, etc. */
"Unable to remove %@ from group %@." = "Unable to remove %1$@ from group %2$@.";

/* where %@ is a record name like user1 */
"Unable to remove %@ from group." = "Unable to remove %@ from group.";

/* No comment provided by engineer. */
"Unable to remove a member from group." = "Unable to remove a member from group.";

/* where %1@ is an attribute like RecordName/PhoneNumber, %2@ is a record name like user1 */
"Unable to remove a value from %@ for record %@." = "Unable to remove a value from %1$@ for record %2$@.";

/* where %@ is an attribute like RecordName/PhoneNumber */
"Unable to remove a value from %@ for the record." = "Unable to remove a value from %@ for the record.";

/* %@ is a record name like user1 */
"Unable to remove an attribute value for record %@." = "Unable to remove an attribute value for record %@.";

/* No comment provided by engineer. */
"Unable to remove an attribute value from the record." = "Unable to remove an attribute value from the record.";

/* where %@ is a record name like myGroup */
"Unable to remove member from group %@." = "Unable to remove member from group %@.";

/* where %1@ is an attribute value like 555-1212, %2@ is a record name like user1 */
"Unable to remove the attribute value %@ for record %@." = "Unable to remove the attribute value %1$@ for record %2$@.";

/* where %@ is a node name like /LDAPv3/127.0.0.1 */
"Unable to retrieve a record from %@." = "Unable to retrieve a record from %@.";

/* No comment provided by engineer. */
"Unable to retrieve a record from node." = "Unable to retrieve a record from node.";

/* No comment provided by engineer. */
"Unable to retrieve password policies for a record." = "Unable to retrieve password policies for a record.";

/* where %@ is a record name like user1 */
"Unable to retrieve password policies for record %@." = "Unable to retrieve password policies for record %@.";

/* where %1@ is a record name like user1 and %2@ is a node name like /LDAPv3/127.0.0.1 */
"Unable to retrieve record %@ from %@." = "Unable to retrieve record %1$@ from %2$@.";

/* where %@ is a record name like user1 */
"Unable to retrieve record %@ from node." = "Unable to retrieve record %@ from node.";

/* No comment provided by engineer. */
"Unable to retrieve results for query." = "Unable to retrieve results for query.";

/* where %1@ is an attribute value like 555-1212, %2@ is an attribute like PhoneNumber or Recordname and %3@ is a record name like user1 */
"Unable to set %@ for %@ in record %@." = "Unable to set %1$@ for %2$@ in record %3$@.";

/* where %1@ is an attribute value like 555-1212, %2@ is an attribute like PhoneNumber or Recordname */
"Unable to set %@ to %@ in record." = "Unable to set %1$@ to %2$@ in record.";

/* where %@ is an attribute like PhoneNumber */
"Unable to set attribute value(s) for %@." = "Unable to set attribute value(s) for %@.";

/* No comment provided by engineer. */
"Unable to set attribute value(s) for a record." = "Unable to set attribute value(s) for a record.";

/* where %@ is a node name like /LDAPv3/127.0.0.1 */
"Unable to set extended node credentials for %@." = "Unable to set extended node credentials for %@.";

/* No comment provided by engineer. */
"Unable to set extended node credentials." = "Unable to set extended node credentials.";

/* where %1@ is a node name like /LDAPv3/127.0.0.1 and %2@ is a record name like user1 */
"Unable to set node credentials for %@ with record name %@." = "Unable to set node credentials for %1$@ with record name %2$@.";

/* %@ is the name of a domain/node
   where %@ is a node name like /LDAPv3/127.0.0.1 */
"Unable to set node credentials for %@." = "Unable to set node credentials for %@.";

/* where %@ is a record name as provided by caller like user1 */
"Unable to set node credentials with record name %@." = "Unable to set node credentials with record name %@.";

/* No comment provided by engineer. */
"Unable to set node credentials." = "Unable to set node credentials.";

/* No comment provided by engineer. */
"Unable to set replay cache." = "Unable to set replay cache.";

/* where %1@ is an attribute like PhoneNumber or Recordname and %2@ is a record name like user1 */
"Unable to set the attribute value %@ in record %@." = "Unable to set the attribute value %1$@ in record %2$@.";

/* No comment provided by engineer. */
"Unable to set the extended node credentials for a record." = "Unable to set the extended node credentials for a record.";

/* where %@ is a record name like user1 */
"Unable to set the extended node credentials for the record %@." = "Unable to set the extended node credentials for the record %@.";

/* No comment provided by engineer. */
"Unable to set the node credentials for a record." = "Unable to set the node credentials for a record.";

/* where %@ is a record name like user1 */
"Unable to set the node credentials for the record %@." = "Unable to set the node credentials for the record %@.";

/* No comment provided by engineer. */
"Unable to set the principal for the server." = "Unable to set the principal for the server.";

/* where %@ is a record name like user1 */
"Unable to set then record name to %@." = "Unable to set then record name to %@.";

/* %1@ is an attribute like PhoneNumber or Recordname and %2@ is a record name like user1 */
"Unable to set value(s) for %@ in record %@." = "Unable to set value(s) for %1$@ in record %2$@.";

/* %@ is an attribute like PhoneNumber or Recordname */
"Unable to set value(s) for %@ in record." = "Unable to set value(s) for %@ in record.";

/* where %@ is some attribute like PhoneNumber or RecordName */
"Unable to set values for an attribute %@ of a record." = "Unable to set values for an attribute %@ of a record.";

/* No comment provided by engineer. */
"Unable to synchronize the record." = "Unable to synchronize the record.";

/* No comment provided by engineer. */
"Unable to verify extended credentials for a record." = "Unable to verify extended credentials for a record.";

/* where %@ is a record name like user1 */
"Unable to verify extended credentials for record %@." = "Unable to verify extended credentials for record %@.";

/* No comment provided by engineer. */
"Unable to verify password for a record." = "Unable to verify password for a record.";

/* where %@ is a record name like user1 */
"Unable to verify password for record %@." = "Unable to verify password for record %@.";

/* No comment provided by engineer. */
"Unknown error code." = "Unknown error code.";

/* No comment provided by engineer. */
"Unknown user." = "Unknown user.";

/* No comment provided by engineer. */
"Unrecoverable password." = "Unrecoverable password.";

/* No comment provided by engineer. */
"Username is missing." = "Username is missing.";

